#Mon Aug 16 15:43:04 EDT 2004
PLUGIN_NAME=Folha de Apontamentos
PROVIDER_NAME=Eclipse.org
CHEAT_SHEET_CONTENT=conte\u00FAdo da Folha de Apontamentos
CHEAT_SHEET_ITEM_EXTENSION=Extens\u00E3o do Item da Folha de Apontamentos
CHEAT_SHEETS=Folhas de Apontamentos
CHEAT_SHEETS_MENU=&Folhas de Apontamentos...
ERROR_READING_STATE_FILE=N\u00E3o foi poss\u00EDvel ler as informa\u00E7\u00F5es de estado.
ERROR_WRITING_STATE_FILE=N\u00E3o foi poss\u00EDvel armazenar as informa\u00E7\u00F5es de estado.
CHEAT_SHEET_SELECTION_DIALOG_TITLE=Sele\u00E7\u00E3o de Folha de Apontamentos
CHEAT_SHEET_SELECTION_DIALOG_MSG=Selecione a folha de apontamentos a ser aberta\:
COLLAPSE_ALL_BUT_CURRENT_TOOLTIP=Reduzir Todos os Itens Menos o Atual
RESTORE_ALL_TOOLTIP=Expandir para Estados de Expans\u00E3o Anteriores
CHEAT_SHEET_OTHER_MENU=Outro...
PERFORM_TASK_TOOLTIP=Clicar para Executar
SKIP_TASK_TOOLTIP=Clicar para Ignorar
COMPLETE_TASK_TOOLTIP=Clicar para Concluir
RESTART_TASK_TOOLTIP=Clicar para Refazer
LESS_THAN_2_SUBITEMS=Menos de 2 sub-itens localizados para o pr\u00F3ximo item.  Isso n\u00E3o \u00E9 permitido.  Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_FINDING_PLUGIN_FOR_ACTION=A a\u00E7\u00E3o n\u00E3o p\u00F4de ser executada porque o plug-in ''{0}'' n\u00E3o foi localizado.
ERROR_DATA_MISSING=Ocorreu um erro ao executar a folha de apontamentos devido a dados ausentes. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_DATA_MISSING_LOG=Os dados para a vari\u00E1vel ''{0}'' n\u00E3o foram inicializados corretamente antes da tentativa de uso.
ERROR_CONDITIONAL_DATA_MISSING_LOG=Nenhum subitem correspondeu \u00E0 condi\u00E7\u00E3o ''{0}'' especificada para o subitem condicional ''{1}''.
ERROR_LOADING_CLASS_FOR_ACTION=A a\u00E7\u00E3o n\u00E3o p\u00F4de ser executada porque a classe ''{0}'' n\u00E3o p\u00F4de ser carregada.
ERROR_CREATING_CLASS_FOR_ACTION=A a\u00E7\u00E3o n\u00E3o p\u00F4de ser executada porque uma inst\u00E2ncia da classe ''{0}'' n\u00E3o pode ser criada.
START_CHEATSHEET_TOOLTIP=Clicar para Iniciar
RESTART_CHEATSHEET_TOOLTIP=Clicar para Reiniciar
HELP_BUTTON_TOOLTIP=Abrir Ajuda Relacionada
ERROR_RUNNING_ACTION=A a\u00E7\u00E3o n\u00E3o p\u00F4de ser executada. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_INVALID_CHEATSHEET_ID=A folha de apontamentos ''{0}'' n\u00E3o existe. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_CHEATSHEET_DOESNOT_EXIST=A folha de apontamentos especificada n\u00E3o existe. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_APPLYING_STATE_DATA=O estado salvo da folha de apontamentos atual n\u00E3o \u00E9 aplicado. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_APPLYING_STATE_DATA_LOG=O estado salvo do arquivo ''{0}'' para a folha de apontamentos ''{1}'' atual n\u00E3o \u00E9 aplicado. 
INITIAL_VIEW_DIRECTIONS=Para exibir uma folha de apontamentos, selecione uma no menu Ajuda ou no menu da barra de ferramentas local da visualiza\u00E7\u00E3o.
ERROR_LOADING_CHEATSHEET_CONTENT=Erro ao carregar o conte\u00FAdo da folha de apontamentos.
ERROR_PAGE_MESSAGE=Ocorreu um erro ao carregar o arquivo de conte\u00FAdo da folha de apontamentos.  Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_LOADING_CLASS=N\u00E3o foi poss\u00EDvel carregar a classe ''{0}''. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
ERROR_CREATING_CLASS=N\u00E3o foi poss\u00EDvel criar uma inst\u00E2ncia da classe ''{0}''. Entre em contato com o fornecedor da folha de apontamentos para obter ajuda.
CHEAT_SHEET_OTHER_CATEGORY=Outras
LAUNCH_SHEET_ERROR=Erro ao carregar a exibi\u00E7\u00E3o da folha de apontamentos
CHEAT_SHEET_ERROR_OPENING=Erro ao abrir folha de apontamentos
ERROR_OPENING_PERSPECTIVE=Erro ao abrir perspectiva.
ERROR_CREATING_STATEFILE_URL=Erro ao criar url do arquivo de estado, ''{0}''.
ERROR_SAVING_STATEFILE_URL=Erro ao salvar arquivo de estado para a folha de apontamentos ''{0}''.
ERROR_READING_MANAGERDATA_FROM_STATEFILE=Erro ao ler dados CheatSheetManager para a chave ''{0}'' no arquivo de estado para a folha de apontamentos ''{1}''.
CHEAT_SHEET_INTRO_TITLE=Introdu\u00E7\u00E3o
ERROR_TITLE=Erro da Folha de Apontamentos
ERROR_CREATING_DOCUMENT_BUILDER=Ocorreu erro ao criar DocumentBuilder, verifique se o JRE est\u00E1 configurado corretamente.
ERROR_DOCUMENT_BUILDER_NOT_INIT=O DocumentBuilder n\u00E3o foi inicializado, verifique se o JRE est\u00E1 configurado corretamente.
ERROR_OPENING_FILE=N\u00E3o foi poss\u00EDvel abrir o arquivo de conte\u00FAdo da folha de apontamentos, {0}.
ERROR_OPENING_FILE_IN_PARSER=Arquivo de conte\u00FAdo da folha de apontamentos ''{0}'' n\u00E3o encontrado pelo analisador.
ERROR_SAX_PARSING=O arquivo de conte\u00FAdo da folha de apontamentos ''{0}'' n\u00E3o p\u00F4de ser analisado.
ERROR_SAX_PARSING_WITH_LOCATION=O arquivo de conte\u00FAdo da folha de apontamentos ''{0}'' n\u00E3o p\u00F4de ser analisado, erro na linha ''{1}'', coluna ''{2}''.
ERROR_PARSING_CHEATSHEET_CONTENTS=Erro ao analisar DOM de folha de apontamentos.
ERROR_PARSING_CHEATSHEET_ELEMENT=O elemento <cheatsheet> deve ser o n\u00F3 raiz do arquivo de conte\u00FAdo da folha de apontamentos.
ERROR_PARSING_NO_INTRO=O arquivo de conte\u00FAdo da folha de apontamentos deve conter um elemento <intro>.
ERROR_PARSING_MORE_THAN_ONE_INTRO=O arquivo de conte\u00FAdo da folha de apontamentos s\u00F3 pode conter um elemento <intro>.
ERROR_PARSING_NO_ITEM=O arquivo de conte\u00FAdo da folha de apontamentos deve conter pelo menos um elemento <item>.
ERROR_PARSING_PARAM_INVALIDRANGE=A a\u00E7\u00E3o possui um par\u00E2metro ''{0}'' que especificou um intervalo inv\u00E1lido ''{1}''.
ERROR_PARSING_PARAM_INVALIDNUMBER=A a\u00E7\u00E3o possui um par\u00E2metro que especificou um n\u00FAmero de par\u00E2metro inv\u00E1lido.
ERROR_PARSING_NO_DESCRIPTION=A descri\u00E7\u00E3o para o elemento ''{0}'' n\u00E3o foi definida.
ERROR_PARSING_NO_SUBITEM=O elemento ''{0}'' deve especificar um elemento sub-item.
ERROR_PARSING_NO_ACTION=O elemento ''{0}'' deve especificar um elemento a\u00E7\u00E3o.
ERROR_PARSING_NO_TITLE=O elemento ''{0}'' deve especificar um atributo de t\u00EDtulo.
ERROR_PARSING_NO_CLASS=O elemento ''{0}'' deve especificar um atributo de classe.
ERROR_PARSING_NO_PLUGINID=O elemento ''{0}'' deve especificar um atributo de ID de plug-in.
ERROR_PARSING_NO_CONDITION=O elemento ''{0}'' deve especificar um atributo de condi\u00E7\u00E3o.
ERROR_PARSING_NO_VALUES=O elemento ''{0}'' deve especificar um atributo de valores.
ERROR_PARSING_NO_LABEL=O elemento ''{0}'' deve especificar um atributo de r\u00F3tulo.
WARNING_PARSING_UNKNOWN_ATTRIBUTE=Atributo desconhecido ''{0}'' especificado para o elemento ''{1}''.
WARNING_PARSING_UNKNOWN_ELEMENT=Elemento desconhecido ''{0}'' especificado para o elemento ''{1}''.
WARNING_PARSING_DESCRIPTION_UNKNOWN_ELEMENT=A descri\u00E7\u00E3o para o elemento ''{0}'' cont\u00E9m um elemento desconhecido ''{1}''.
