#Mon Aug 16 15:43:03 EDT 2004
PLUGIN_NAME=Aide-m\u00E9moire
PROVIDER_NAME=Eclipse.org
CHEAT_SHEET_CONTENT=Contenu de l'aide-m\u00E9moire
CHEAT_SHEET_ITEM_EXTENSION=Extension d'un \u00E9l\u00E9ment de l'aide-m\u00E9moire
CHEAT_SHEETS=Aide-m\u00E9moire
CHEAT_SHEETS_MENU=&Aide-m\u00E9moire...
ERROR_READING_STATE_FILE=Impossible de lire les informations d'\u00E9tat
ERROR_WRITING_STATE_FILE=Impossible de stocker les informations d'\u00E9tat
CHEAT_SHEET_SELECTION_DIALOG_TITLE=S\u00E9lection d'un aide-m\u00E9moire
CHEAT_SHEET_SELECTION_DIALOG_MSG=S\u00E9lectionnez l'aide-m\u00E9moire \u00E0 ouvrir \:
COLLAPSE_ALL_BUT_CURRENT_TOOLTIP=R\u00E9duire tous les \u00E9l\u00E9ments sauf celui en cours
RESTORE_ALL_TOOLTIP=Etendre aux \u00E9tats d'extension pr\u00E9c\u00E9dents
CHEAT_SHEET_OTHER_MENU=Autre...
PERFORM_TASK_TOOLTIP=Cliquez ici pour ex\u00E9cuter
SKIP_TASK_TOOLTIP=Cliquez ici pour ignorer
COMPLETE_TASK_TOOLTIP=Cliquez ici pour terminer
RESTART_TASK_TOOLTIP=Cliquez ici pour r\u00E9p\u00E9ter
LESS_THAN_2_SUBITEMS=Moins de 2 sous-\u00E9l\u00E9ments ont \u00E9t\u00E9 localis\u00E9s pour l'\u00E9l\u00E9ment suivant.  Ce n'est pas autoris\u00E9. Pour obtenir de l'assistance, adressez-vous au fournisseur de l'aide-m\u00E9moire.
ERROR_FINDING_PLUGIN_FOR_ACTION=L''action indiqu\u00E9e n''a pas pu s''ex\u00E9cuter car le plugin ''{0}'' sp\u00E9cifi\u00E9 est introuvable.
ERROR_DATA_MISSING=Une erreur s'est produite lors de l'ex\u00E9cution de l'aide-m\u00E9moire en raison de donn\u00E9es manquantes.  Pour obtenir de l'assistance, adressez-vous au fournisseur de l'aide-m\u00E9moire.
ERROR_DATA_MISSING_LOG=Les donn\u00E9es de la variable ''{0}'' n''ont pas \u00E9t\u00E9 initialis\u00E9es correctement avant leur utilisation.
ERROR_CONDITIONAL_DATA_MISSING_LOG=Aucun sous-\u00E9l\u00E9ment ne respecte la condition ''{0}'' indiqu\u00E9e pour l''\u00E9l\u00E9ment conditional-subitem ''{1}''.
ERROR_LOADING_CLASS_FOR_ACTION=L''action indiqu\u00E9e n''a pas pu s''ex\u00E9cuter car la classe ''{0}'' sp\u00E9cifi\u00E9e est introuvable.
ERROR_CREATING_CLASS_FOR_ACTION=L''action indiqu\u00E9e n''a pas pu s''ex\u00E9cuter car une instance de la classe ''{0}'' est introuvable.
START_CHEATSHEET_TOOLTIP=Cliquez ici pour commencer
RESTART_CHEATSHEET_TOOLTIP=Cliquez ici pour relancer
HELP_BUTTON_TOOLTIP=Ouvre l'aide connexe
ERROR_RUNNING_ACTION=L'action n'a pas pu s'ex\u00E9cuter. Pour obtenir de l'assistance, adressez-vous au fournisseur de l'aide-m\u00E9moire.
ERROR_INVALID_CHEATSHEET_ID=L''aide-m\u00E9moire ''{0}'' n''existe pas. Pour obtenir de l''assistance, adressez-vous au fournisseur de l''aide-m\u00E9moire.
ERROR_CHEATSHEET_DOESNOT_EXIST=L'aide-m\u00E9moire indiqu\u00E9 n'existe pas.  Pour obtenir de l'assistance, adressez-vous au fournisseur de l'aide-m\u00E9moire.
ERROR_APPLYING_STATE_DATA=L'\u00E9tat sauvegard\u00E9 de l'aide-m\u00E9moire n'a pas \u00E9t\u00E9 appliqu\u00E9.  Pour obtenir de l'assistance, adressez-vous au fournisseur de l'aide-m\u00E9moire.
ERROR_APPLYING_STATE_DATA_LOG=L''\u00E9tat sauvegard\u00E9 du fichier ''{0}'' pour l''aide-m\u00E9moire''{1}'' n''a pas \u00E9t\u00E9 appliqu\u00E9. 
INITIAL_VIEW_DIRECTIONS=Pour afficher un aide-m\u00E9moire, s\u00E9lectionnez-le dans le menu Aide ou dans le menu de la barre d'outils locale de la vue.
ERROR_LOADING_CHEATSHEET_CONTENT=Erreur lors du chargement du contenu de l'aide-m\u00E9moire.
ERROR_PAGE_MESSAGE=Une erreur s'est produite lors du chargement du fichier contenant l'aide-m\u00E9moire. Pour obtenir de l'assistance, adressez-vous au fournisseur de l'aide-m\u00E9moire.
ERROR_LOADING_CLASS=La classe ''{0}'' n''a pas pu \u00EAtre charg\u00E9e. Pour obtenir de l''assistance, adressez-vous au fournisseur de l''aide-m\u00E9moire.
ERROR_CREATING_CLASS=Une instance de la classe ''{0}'' n''a pas pu \u00EAtre cr\u00E9\u00E9e. Pour obtenir de l''assistance, adressez-vous au fournisseur de l''aide-m\u00E9moire.
CHEAT_SHEET_OTHER_CATEGORY=Autre
LAUNCH_SHEET_ERROR=Erreur lors du chargement de la vue Aide-m\u00E9moire
CHEAT_SHEET_ERROR_OPENING=Erreur lors de l'ouverture de l'aide-m\u00E9moire
ERROR_OPENING_PERSPECTIVE=Erreur lors de l'ouverture de la perspective.
ERROR_CREATING_STATEFILE_URL=Erreur lors de la cr\u00E9ation de l''URL du fichier d''\u00E9tat, ''{0}''.
ERROR_SAVING_STATEFILE_URL=Erreur lors de la sauvegarde du fichier d''\u00E9tat pour l''aide-m\u00E9moire ''{0}''.
ERROR_READING_MANAGERDATA_FROM_STATEFILE=Erreur lors de la lecture des donn\u00E9es CheatSheetManager pour la cl\u00E9 ''{0}'' \u00E0 partir du fichier d''\u00E9tat de l''aide-m\u00E9moire ''{1}''.
CHEAT_SHEET_INTRO_TITLE=Introduction
ERROR_TITLE=Erreur li\u00E9e \u00E0 l'aide-m\u00E9moire
ERROR_CREATING_DOCUMENT_BUILDER=Une erreur s'est produite lors de la cr\u00E9ation de DocumentBuilder. V\u00E9rifiez que l'environnement JRE est correctement configur\u00E9.
ERROR_DOCUMENT_BUILDER_NOT_INIT=DocumentBuilder n'a pas \u00E9t\u00E9 initialis\u00E9. V\u00E9rifiez que l'environnement JRE est correctement configur\u00E9.
ERROR_OPENING_FILE=Impossible d''ouvrir le fichier de contenu de l'aide-m\u00E9moire, {0}.
ERROR_OPENING_FILE_IN_PARSER=Le programme d'analyse syntaxique n''est pas parvenu \u00E0 localiser le fichier de contenu de l''aide-m\u00E9moire ''{0}''.
ERROR_SAX_PARSING=Impossible d''effectuer l'analyse syntaxique du fichier de contenu de l''aide m\u00E9moire ''{0}''.
ERROR_SAX_PARSING_WITH_LOCATION=Impossible d''effectuer l'analyse syntaxique du fichier de contenu de l''aide m\u00E9moire ''{0}''. Erreur \u00E0 la ligne ''{1}'', colonne ''{2}''.
ERROR_PARSING_CHEATSHEET_CONTENTS=Erreur lors de l'analyse du module DOM de l'aide-m\u00E9moire.
ERROR_PARSING_CHEATSHEET_ELEMENT=L'\u00E9l\u00E9ment <cheatsheet> doit repr\u00E9senter le noeud racine du fichier de contenu de l'aide-m\u00E9moire.
ERROR_PARSING_NO_INTRO=Le fichier de contenu de l'aide-m\u00E9moire doit comporter un \u00E9l\u00E9ment <intro>.
ERROR_PARSING_MORE_THAN_ONE_INTRO=Le fichier de contenu de l'aide-m\u00E9moire doit comporter un seul \u00E9l\u00E9ment <intro>.
ERROR_PARSING_NO_ITEM=Le fichier de contenu de l'aide-m\u00E9moire doit comporter au moins un \u00E9l\u00E9ment <item>.
ERROR_PARSING_PARAM_INVALIDRANGE=L''action comporte un param\u00E8tre ''{0}'' qui indique une plage incorrecte ''{1}''.
ERROR_PARSING_PARAM_INVALIDNUMBER=L''action comporte un param\u00E8tre qui indique un num\u00E9ro de param\u00E8tre incorrect.
ERROR_PARSING_NO_DESCRIPTION=La description de l''\u00E9l\u00E9ment ''{0}'' n''a pas \u00E9t\u00E9 d\u00E9finie.
ERROR_PARSING_NO_SUBITEM=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un \u00E9l\u00E9ment subitem.
ERROR_PARSING_NO_ACTION=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un \u00E9l\u00E9ment action.
ERROR_PARSING_NO_TITLE=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un \u00E9l\u00E9ment title.
ERROR_PARSING_NO_CLASS=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un \u00E9l\u00E9ment class.
ERROR_PARSING_NO_PLUGINID=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un attribut pluginId.
ERROR_PARSING_NO_CONDITION=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un attribut condition.
ERROR_PARSING_NO_VALUES=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un attribut values.
ERROR_PARSING_NO_LABEL=L''\u00E9l\u00E9ment ''{0}'' doit d\u00E9finir un attribut label.
WARNING_PARSING_UNKNOWN_ATTRIBUTE=Attribut inconnu ''{0}'' indiqu\u00E9 pour l''\u00E9l\u00E9ment ''{1}''.
WARNING_PARSING_UNKNOWN_ELEMENT=El\u00E9ment inconnu ''{0}'' indiqu\u00E9 pour l''\u00E9l\u00E9ment ''{1}''.
WARNING_PARSING_DESCRIPTION_UNKNOWN_ELEMENT=La description de l''\u00E9l\u00E9ment ''{0}'' contient un \u00E9l\u00E9ment inconnu ''{1}''.
