#Mon Aug 16 15:43:03 EDT 2004
PLUGIN_NAME=Hojas de apuntes
PROVIDER_NAME=Eclipse.org
CHEAT_SHEET_CONTENT=Contenido de la hoja de apuntes
CHEAT_SHEET_ITEM_EXTENSION=Extensi\u00F3n de \u00EDtem de hoja de apuntes
CHEAT_SHEETS=Hojas de apuntes
CHEAT_SHEETS_MENU=&Hojas de apuntes...
ERROR_READING_STATE_FILE=No se ha podido leer la informaci\u00F3n de estado.
ERROR_WRITING_STATE_FILE=No se ha podido almacenar la informaci\u00F3n de estado.
CHEAT_SHEET_SELECTION_DIALOG_TITLE=Selecci\u00F3n de hoja de apuntes
CHEAT_SHEET_SELECTION_DIALOG_MSG=Seleccione la hoja de apuntes que hay que abrir\:
COLLAPSE_ALL_BUT_CURRENT_TOOLTIP=Contraer todos los \u00EDtems menos el actual
RESTORE_ALL_TOOLTIP=Expandir a estados de expansi\u00F3n anteriores
CHEAT_SHEET_OTHER_MENU=Otras...
PERFORM_TASK_TOOLTIP=Pulse aqu\u00ED para realizar
SKIP_TASK_TOOLTIP=Pulse aqu\u00ED para saltar
COMPLETE_TASK_TOOLTIP=Pulse aqu\u00ED para finalizar
RESTART_TASK_TOOLTIP=Pulse aqu\u00ED para rehacer
LESS_THAN_2_SUBITEMS=Se han encontrado menos de 2 sub\u00EDtems para el \u00EDtem siguiente.  Esto no est\u00E1 permitido.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_FINDING_PLUGIN_FOR_ACTION=La acci\u00F3n no se ha podido ejecutar porque no se ha podido encontrar el conector ''{0}''.
ERROR_DATA_MISSING=Se produjo un error mientras se ejecutaba la hoja de apuntes porque faltaban datos.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_DATA_MISSING_LOG=Los datos de la variable ''{0}'' no se se han inicializado debidamente antes de intentar utilizarlos.
ERROR_CONDITIONAL_DATA_MISSING_LOG=Ning\u00FAn subelemento ha cumplido la condici\u00F3n ''{0}'' especificada para el subelemento condicional ''{1}''.
ERROR_LOADING_CLASS_FOR_ACTION=La acci\u00F3n no ha podido ejecutarse porque no se ha podido cargar la clase ''{0}''.
ERROR_CREATING_CLASS_FOR_ACTION=La acci\u00F3n no ha podido ejecutarse porque no se ha podido crear una instancia de la clase ''{0}''.
START_CHEATSHEET_TOOLTIP=Pulse aqu\u00ED para empezar
RESTART_CHEATSHEET_TOOLTIP=Pulse aqu\u00ED para reiniciar
HELP_BUTTON_TOOLTIP=Abrir la ayuda relacionada
ERROR_RUNNING_ACTION=No se ha podido ejecutar la acci\u00F3n.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_INVALID_CHEATSHEET_ID=La hoja de apuntes ''{0}'' no existe.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_CHEATSHEET_DOESNOT_EXIST=La hoja de apuntes especificada no existe.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_APPLYING_STATE_DATA=El estado guardado para la hoja de apuntes no est\u00E1 aplicado actualmente.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_APPLYING_STATE_DATA_LOG=El estado guardado del archivo ''{0}'' para la hoja de apuntes ''{1}'' no est\u00E1 aplicado actualmente. 
INITIAL_VIEW_DIRECTIONS=Para visualizar una hoja de apuntes, seleccione una en el men\u00FA Ayuda o en el men\u00FA de la barra de herramientas local de la vista.
ERROR_LOADING_CHEATSHEET_CONTENT=Se ha producido un error al cargar el contenido de la hoja de apuntes.
ERROR_PAGE_MESSAGE=Se ha producido un error al cargar el archivo de contenido de la hoja de apuntes.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_LOADING_CLASS=No se ha podido cargar la clase ''{0}''.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
ERROR_CREATING_CLASS=No se ha podido crear una instancia de la clase ''{0}''.  P\u00F3ngase en contacto con el proveedor de la hoja de apuntes para obtener ayuda.
CHEAT_SHEET_OTHER_CATEGORY=Otras
LAUNCH_SHEET_ERROR=Se ha producido un error al cargar la vista de la hoja de apuntes
CHEAT_SHEET_ERROR_OPENING=Se ha producido un error al abrir la hoja de apuntes
ERROR_OPENING_PERSPECTIVE=Error al abrir la perspectiva.
ERROR_CREATING_STATEFILE_URL=Error al crear el URL de archivo de estado, ''{0}''.
ERROR_SAVING_STATEFILE_URL=Error al guardar el archivo de estado de la hoja de apuntes ''{0}''.
ERROR_READING_MANAGERDATA_FROM_STATEFILE=Error al leer datos de CheatSheetManager para la clave ''{0}'' del archivo de estado correspondiente a la hoja de apuntes de ''{1}''.
CHEAT_SHEET_INTRO_TITLE=Introducci\u00F3n
ERROR_TITLE=Error de hoja de apuntes
ERROR_CREATING_DOCUMENT_BUILDER=Se produjo un error al crear DocumentBuilder; verifique que el JRE est\u00E1 debidamente configurado.
ERROR_DOCUMENT_BUILDER_NOT_INIT=El DocumentBuilder no se ha inicializado; verifique que el JRE est\u00E1 debidamente configurado.
ERROR_OPENING_FILE=No se ha podido abrir el archivo de contenido de la hoja de apuntes, {0}.
ERROR_OPENING_FILE_IN_PARSER=El analizador no ha encontrado el archivo de contenido ''{0}'' de la hoja de apuntes.
ERROR_SAX_PARSING=No se ha podido analizar el archivo de contenido ''{0}'' de la hoja de apuntes.
ERROR_SAX_PARSING_WITH_LOCATION=No se ha podido analizar el archivo de contenido ''{0}'' de la hoja de apuntes; hab\u00EDa un error en la l\u00EDnea ''{1}'', columna ''{2}''.
ERROR_PARSING_CHEATSHEET_CONTENTS=Error al analizar el DOM de la hoja de apuntes.
ERROR_PARSING_CHEATSHEET_ELEMENT=El elemento <cheatsheet> debe ser el nodo ra\u00EDz del archivo de contenido de la hoja de apuntes.
ERROR_PARSING_NO_INTRO=Debe haber un elemento <intro> en el archivo de contenido de la hoja de apuntes.
ERROR_PARSING_MORE_THAN_ONE_INTRO=Solo puede haber un \u00FAnico elemento <intro> en el archivo de contenido de la hoja de apuntes.
ERROR_PARSING_NO_ITEM=Debe haber como m\u00EDnimo un elemento <item> en el archivo de contenido de la hoja de apuntes.
ERROR_PARSING_PARAM_INVALIDRANGE=La acci\u00F3n tiene un par\u00E1metro ''{0}'' que ha especificado un rango no v\u00E1lido ''{1}''.
ERROR_PARSING_PARAM_INVALIDNUMBER=La acci\u00F3n tiene un par\u00E1metro que ha especificado un n\u00FAmero de par\u00E1metro no v\u00E1lido.
ERROR_PARSING_NO_DESCRIPTION=No se ha definido la descripci\u00F3n del elemento ''{0}''.
ERROR_PARSING_NO_SUBITEM=El elemento ''{0}'' debe especificar un elemento subitem.
ERROR_PARSING_NO_ACTION=El elemento ''{0}'' debe especificar un elemento action.
ERROR_PARSING_NO_TITLE=El elemento ''{0}'' debe especificar un atributo title.
ERROR_PARSING_NO_CLASS=El elemento ''{0}'' debe especificar un atributo class.
ERROR_PARSING_NO_PLUGINID=El elemento ''{0}'' debe especificar un atributo pluginId.
ERROR_PARSING_NO_CONDITION=El elemento ''{0}'' debe especificar un atributo condition.
ERROR_PARSING_NO_VALUES=El elemento ''{0}'' debe especificar un atributo values.
ERROR_PARSING_NO_LABEL=El elemento ''{0}'' debe especificar un atributo label.
WARNING_PARSING_UNKNOWN_ATTRIBUTE=Se ha especificado el atributo desconocido ''{0}'' para el elemento ''{1}''.
WARNING_PARSING_UNKNOWN_ELEMENT=Se ha especificado el elemento desconocido ''{0}'' para el elemento ''{1}''.
WARNING_PARSING_DESCRIPTION_UNKNOWN_ELEMENT=La descripci\u00F3n del elemento ''{0}'' contiene un elemento desconocido ''{1}''.
