#Mon Aug 16 15:38:34 EDT 2004
pluginName=\u30C7\u30D0\u30C3\u30B0\u306E UI
BreakpointsView.name=\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8
commonTabName=\u5171\u901A(&C)
ConsoleColorProvidersExtensionName=\u30B3\u30F3\u30BD\u30FC\u30EB\u8272\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
ConsoleFontDefinition.description=\u30C7\u30D0\u30C3\u30B0\u30FB\u30B3\u30F3\u30BD\u30FC\u30EB\u3067\u306F\u30C7\u30D0\u30C3\u30B0\u30FB\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30C6\u30AD\u30B9\u30C8\u30FB\u30D5\u30A9\u30F3\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059
ConsoleFontDefinition.label=\u30C7\u30D0\u30C3\u30B0\u30FB\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30C6\u30AD\u30B9\u30C8\u30FB\u30D5\u30A9\u30F3\u30C8
ConsoleLineTrackersExtensionName=\u30B3\u30F3\u30BD\u30FC\u30EB\u884C\u30C8\u30E9\u30C3\u30AB\u30FC
LaunchingPreferencePage.name=\u8D77\u52D5
ViewManagementPreferencePage.name=\u30D3\u30E5\u30FC\u7BA1\u7406
ConsolePreferencePage.name=\u30B3\u30F3\u30BD\u30FC\u30EB
DebugModelContextBindingsName=\u30C7\u30D0\u30C3\u30B0\u30FB\u30E2\u30C7\u30EB\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u7D50\u5408
DebugModelActivityBindingsName=\u30C7\u30D0\u30C3\u30B0\u30FB\u30E2\u30C7\u30EB\u306E\u30A2\u30AF\u30C6\u30A3\u30D3\u30C6\u30A3\u30FC\u7D50\u5408
ContextViewBindingsName=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30D3\u30E5\u30FC\u306E\u7D50\u5408
BreakpoingActionSet.label=\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8
CopyToClipboardAction.label=\u30B9\u30BF\u30C3\u30AF\u306E\u30B3\u30D4\u30FC(&C)
CopyVariablesToClipboardAction.label=\u5909\u6570\u306E\u30B3\u30D4\u30FC(&V)
DebugActionSet.label=\u30C7\u30D0\u30C3\u30B0
DebugConfigurations.label=\u30C7\u30D0\u30C3\u30B0(&E)...
debugCurrentInstructionPointer=\u73FE\u5728\u306E\u547D\u4EE4\u30DD\u30A4\u30F3\u30BF\u30FC\u306E\u30C7\u30D0\u30C3\u30B0
debugCallStack=\u547C\u3073\u51FA\u3057\u30B9\u30BF\u30C3\u30AF\u306E\u30C7\u30D0\u30C3\u30B0
DebugDropDownAction.label=\u30C7\u30D0\u30C3\u30B0
DebugHistoryMenuAction.label=\u30C7\u30D0\u30C3\u30B0\u30FB\u30D2\u30B9\u30C8\u30EA\u30FC(&H)
DebugLastAction.label=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u30C7\u30D0\u30C3\u30B0(&D)
DebugLaunchGroup.label=\u30C7\u30D0\u30C3\u30B0(&G)
DebugModelPresentationExtensionName=\u30C7\u30D0\u30C3\u30B0\u30FB\u30E2\u30C7\u30EB\u30FB\u30D7\u30EC\u30BC\u30F3\u30C6\u30FC\u30B7\u30E7\u30F3
DebugPerspective.name=\u30C7\u30D0\u30C3\u30B0
DebugPreferencePage.name=\u5B9F\u884C/\u30C7\u30D0\u30C3\u30B0
DebugView.name=\u30C7\u30D0\u30C3\u30B0
DebugViewsCategory.name=\u30C7\u30D0\u30C3\u30B0
DebugWithConfigurationAction.label=\u6B21\u3092\u30C7\u30D0\u30C3\u30B0\u3059\u308B(&A)
DetailPaneFontDefinition.label=\u8A73\u7D30\u30DA\u30A4\u30F3\u306E\u30C6\u30AD\u30B9\u30C8\u30FB\u30D5\u30A9\u30F3\u30C8
DetailPaneFontDefinition.description=\u30C7\u30D0\u30C3\u30B0\u30FB\u30D3\u30E5\u30FC\u306E\u8A73\u7D30\u30DA\u30A4\u30F3\u3067\u306F\u3001\u8A73\u7D30\u30DA\u30A4\u30F3\u306E\u30C6\u30AD\u30B9\u30C8\u30FB\u30D5\u30A9\u30F3\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
DisableBreakpointsAction.label=\u4F7F\u7528\u4E0D\u53EF(&D)
DisconnectAction.label=\u5207\u65AD(&E)
DisconnectAction.tooltip=\u5207\u65AD
EnableBreakpointsAction.label=\u4F7F\u7528\u53EF\u80FD\u306B\u3059\u308B(&E)
ExpressionView.name=\u5F0F
LaunchActionSet.label=\u8D77\u52D5
LaunchConfigurationTabGroupExtensionName=\u8D77\u52D5\u69CB\u6210\u30BF\u30D6\u30FB\u30B0\u30EB\u30FC\u30D7
LaunchShortcutsName=\u8D77\u52D5\u30B7\u30E7\u30FC\u30C8\u30AB\u30C3\u30C8
LaunchConfigurationTypeImageExtensionName=\u8D77\u52D5\u69CB\u6210\u30BF\u30A4\u30D7\u30FB\u30A4\u30E1\u30FC\u30B8 
LaunchConfigurationTypePropertyPage.name=\u8D77\u52D5\u69CB\u6210\u30BF\u30A4\u30D7
LaunchConfigurationTypesPreferencePage.name=\u8D77\u52D5\u69CB\u6210\u30BF\u30A4\u30D7
LauncherPropertyPage.name=\u30E9\u30F3\u30C1\u30E3\u30FC
LaunchGroupsExtensionName=\u8D77\u52D5\u30B0\u30EB\u30FC\u30D7
OpenDebugConfigurations.label=\u30C7\u30D0\u30C3\u30B0(&B)...
OpenRunConfigurations.label=\u5B9F\u884C(&N)...
OpenProfileConfigurations.label=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB(&P)...
processPropertyPageName=\u30D7\u30ED\u30BB\u30B9\u60C5\u5831
ProcessesView.name=\u30D7\u30ED\u30BB\u30B9
ProfileLaunchGroup.label=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB(&P)
ProfileDropDownAction.label=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB
ProfileWithConfigurationAction.label=\u5225\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB(&F)
ProfileHistoryMenuAction.label=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u30FB\u30D2\u30B9\u30C8\u30EA\u30FC(&Y)
ProfileLastAction.label=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB(&L)
ProfileActionSet.label=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB
RegistersView.name=\u30EC\u30B8\u30B9\u30BF\u30FC
RelaunchAction.label=\u518D\u8D77\u52D5(&L)
RemoveAction.label=\u9664\u53BB(&O)
RemoveAllAction.label=\u3059\u3079\u3066\u9664\u53BB(&L)
RemoveAllBreakpointsAction.tooltip=\u3059\u3079\u3066\u306E\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3092\u9664\u53BB
RemoveAllExpressionsAction.tooltip=\u3059\u3079\u3066\u306E\u5F0F\u3092\u9664\u53BB
RemoveAllTerminatedAction.label=\u7D42\u4E86\u3057\u305F\u3059\u3079\u3066\u3092\u9664\u53BB(&A)
RemoveAllTerminatedAction.tooltip=\u7D42\u4E86\u3057\u305F\u3059\u3079\u3066\u306E\u8D77\u52D5\u3092\u9664\u53BB
RemoveBreakpointAction.tooltip=\u9078\u629E\u3055\u308C\u305F\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3092\u9664\u53BB
RemoveExpressionAction.tooltip=\u9078\u629E\u3055\u308C\u305F\u5F0F\u306E\u9664\u53BB
ResumeAction.label=\u518D\u958B(&M)
ResumeAction.tooltip=\u518D\u958B
RunDropDownAction.label=\u5B9F\u884C(&R)
RunMenu.label=\u5B9F\u884C(&R)
RunLastAction.label=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u5B9F\u884C(&R)
RunLaunchGroup.label=\u5B9F\u884C(&N)
RunConfigurations.label=\u69CB\u6210\u306E\u5B9F\u884C(&U)...
RunHistoryMenuAction.label=\u30D2\u30B9\u30C8\u30EA\u30FC\u306E\u5B9F\u884C(&U)
RunWithConfigurationAction.label=\u6B21\u3092\u5B9F\u884C(&S)
RunToLine.label=\u6307\u5B9A\u884C\u307E\u3067\u5B9F\u884C(&L)
SelectAll.label=\u3059\u3079\u3066\u9078\u629E(&A)
StepWithFiltersAction.label=\u30B9\u30C6\u30C3\u30D7\u30FB\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u4F7F\u7528(&F)
StepWithFiltersAction.tooltip=\u30B9\u30C6\u30C3\u30D7\u30FB\u30D5\u30A3\u30EB\u30BF\u30FC/\u30B9\u30C6\u30C3\u30D7\u30FB\u30C7\u30D0\u30C3\u30B0\u306E\u4F7F\u7528
StepIntoAction.label=\u30B9\u30C6\u30C3\u30D7\u30A4\u30F3(&I)
StepIntoAction.tooltip=\u30B9\u30C6\u30C3\u30D7\u30A4\u30F3
StepOverAction.label=\u30B9\u30C6\u30C3\u30D7\u30AA\u30FC\u30D0\u30FC(&O)
StepOverAction.tooltip=\u30B9\u30C6\u30C3\u30D7\u30AA\u30FC\u30D0\u30FC
StepReturnAction.label=\u30B9\u30C6\u30C3\u30D7\u30FB\u30EA\u30BF\u30FC\u30F3(&U)
StepReturnAction.tooltip=\u30B9\u30C6\u30C3\u30D7\u30FB\u30EA\u30BF\u30FC\u30F3
StringVariablePresentationsName=\u30B9\u30C8\u30EA\u30F3\u30B0\u5909\u6570\u8868\u793A
SuspendAction.label=\u4E2D\u65AD(&S)
SuspendAction.tooltip=\u4E2D\u65AD
TerminateAction.label=\u7D42\u4E86(&T)
TerminateAction.tooltip=\u7D42\u4E86
TerminateAllAction.label=\u3059\u3079\u3066\u7D42\u4E86(&N)
TerminateAndRemoveAction.label=\u7D42\u4E86\u304A\u3088\u3073\u9664\u53BB(&V)
ToggleBreakpointAction.label=\u884C\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u306E\u5207\u308A\u66FF\u3048(&K)
ToggleMethodBreakpointAction.label=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u306E\u5207\u308A\u66FF\u3048(&M)
ToggleWatchpointAction.label=\u76E3\u8996\u30DD\u30A4\u30F3\u30C8\u306E\u5207\u308A\u66FF\u3048(&W)
VariablesView.name=\u5909\u6570
StringVariablePreferencePage.name=\u30B9\u30C8\u30EA\u30F3\u30B0\u7F6E\u63DB
string_prompt.description=\u30D7\u30ED\u30F3\u30D7\u30C8\u30FB\u30C0\u30A4\u30A2\u30ED\u30B0\u306B\u5165\u529B\u3055\u308C\u305F\u30C6\u30AD\u30B9\u30C8\u5024\u3092\u623B\u3057\u307E\u3059\u30021 \u3064\u306E\u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u3053\u308C\u306F\u5165\u529B\u30C0\u30A4\u30A2\u30ED\u30B0\u3067\u30D7\u30ED\u30F3\u30D7\u30C8\u306E\u30D2\u30F3\u30C8\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u30022 \u756A\u76EE\u306E\u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u3053\u308C\u306F\u5165\u529B\u30C0\u30A4\u30A2\u30ED\u30B0\u3067\u521D\u671F\u5024\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002 \u6700\u521D\u306E\u5F15\u304D\u6570\u3068 2 \u756A\u76EE\u306E\u5F15\u304D\u6570\u306F\u300C\:\u300D\u3067\u533A\u5207\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
file_prompt.description=\u30D5\u30A1\u30A4\u30EB\u9078\u629E\u30C0\u30A4\u30A2\u30ED\u30B0\u3067\u9078\u629E\u3055\u308C\u305F\u30D5\u30A1\u30A4\u30EB\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 1 \u3064\u306E\u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u3053\u308C\u306F\u30C0\u30A4\u30A2\u30ED\u30B0\u30FB\u30BF\u30A4\u30C8\u30EB\u3067\u30D7\u30ED\u30F3\u30D7\u30C8\u306E\u30D2\u30F3\u30C8\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002 2 \u756A\u76EE\u306E\u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u3053\u308C\u306F\u30D5\u30A1\u30A4\u30EB\u9078\u629E\u30C0\u30A4\u30A2\u30ED\u30B0\u3067\u521D\u671F\u5024\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002 \u6700\u521D\u306E\u5F15\u304D\u6570\u3068 2 \u756A\u76EE\u306E\u5F15\u304D\u6570\u306F\u300C\:\u300D\u3067\u533A\u5207\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
folder_prompt.description=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u9078\u629E\u30C0\u30A4\u30A2\u30ED\u30B0\u3067\u9078\u629E\u3055\u308C\u305F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 1 \u3064\u306E\u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u3053\u308C\u306F\u30C0\u30A4\u30A2\u30ED\u30B0\u30FB\u30BF\u30A4\u30C8\u30EB\u3067\u30D7\u30ED\u30F3\u30D7\u30C8\u306E\u30D2\u30F3\u30C8\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002 2 \u756A\u76EE\u306E\u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u3053\u308C\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u9078\u629E\u30C0\u30A4\u30A2\u30ED\u30B0\u3067\u521D\u671F\u5024\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002 \u6700\u521D\u306E\u5F15\u304D\u6570\u3068 2 \u756A\u76EE\u306E\u5F15\u304D\u6570\u306F\u300C\:\u300D\u3067\u533A\u5207\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
container_loc.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
container_path.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
container_name.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540D\u524D\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
project_loc.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
project_path.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306E\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
project_name.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306E\u540D\u524D\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
resource_loc.description=\u30EA\u30BD\u30FC\u30B9\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
resource_path.description=\u30EA\u30BD\u30FC\u30B9\u306E\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
resource_name.description=\u30EA\u30BD\u30FC\u30B9\u306E\u540D\u524D\u3092\u623B\u3057\u307E\u3059\u3002 \u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u5F15\u304D\u6570\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u9078\u629E\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002\u307E\u305F\u306F\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u3067\u3059\u3002
workspace_loc.description=\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u30FB\u30EB\u30FC\u30C8\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u3092\u623B\u3057\u307E\u3059\u3002 \u5F15\u304D\u6570\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u30EF\u30FC\u30AF\u30B9\u30DA\u30FC\u30B9\u76F8\u5BFE\u30D1\u30B9\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u7D76\u5BFE\u30D5\u30A1\u30A4\u30EB\u30FB\u30B7\u30B9\u30C6\u30E0\u30FB\u30D1\u30B9\u304C\u623B\u3055\u308C\u307E\u3059\u3002
selected_text.description=\u30A2\u30AF\u30C6\u30A3\u30D6\u30FB\u30A8\u30C7\u30A3\u30BF\u30FC\u3067\u73FE\u5728\u9078\u629E\u3055\u308C\u3066\u3044\u308B\u30C6\u30AD\u30B9\u30C8\u3092\u623B\u3057\u307E\u3059\u3002
providerName=Eclipse.org
runCategory.name=\u5B9F\u884C/\u30C7\u30D0\u30C3\u30B0
runCategory.description=\u30B3\u30DE\u30F3\u30C9\u5B9F\u884C/\u30C7\u30D0\u30C3\u30B0\u306E\u30AB\u30C6\u30B4\u30EA\u30FC
NoSourceFoundEditor.name=\u30BD\u30FC\u30B9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DetailPaneWordWrapAction.label=\u8A73\u7D30\u30DA\u30A4\u30F3\u306E\u30C6\u30AD\u30B9\u30C8\u306E\u6298\u308A\u8FD4\u3057(&W)
DetailPaneWordWrapAction.tooltip=\u8A73\u7D30\u30DA\u30A4\u30F3\u306E\u30C6\u30AD\u30B9\u30C8\u3092\u6298\u308A\u8FD4\u3057\u307E\u3059
Context.debugging.description=\u30C7\u30D0\u30C3\u30B0\u30FB\u30D7\u30ED\u30B0\u30E9\u30E0
Context.debugging.name=\u30C7\u30D0\u30C3\u30B0
ActionDefinition.toggleStepFilters.name=\u30B9\u30C6\u30C3\u30D7\u30FB\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u5207\u308A\u66FF\u3048
ActionDefinition.toggleStepFilters.description=\u30C7\u30D0\u30C3\u30B0\u30FB\u30B9\u30C6\u30C3\u30D7\u30FB\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u4F7F\u7528\u53EF\u80FD\u6027\u3092\u5207\u308A\u66FF\u3048\u307E\u3059\u3002
ActionDefinition.stepInto.name=\u30B9\u30C6\u30C3\u30D7\u30A4\u30F3
ActionDefinition.stepInto.description=\u30B9\u30C6\u30C3\u30D7\u30A4\u30F3
ActionDefinition.stepOver.name=\u30B9\u30C6\u30C3\u30D7\u30AA\u30FC\u30D0\u30FC
ActionDefinition.stepOver.description=\u30B9\u30C6\u30C3\u30D7\u30AA\u30FC\u30D0\u30FC
ActionDefinition.stepReturn.name=\u30B9\u30C6\u30C3\u30D7\u30FB\u30EA\u30BF\u30FC\u30F3
ActionDefinition.stepReturn.description=\u30B9\u30C6\u30C3\u30D7\u30FB\u30EA\u30BF\u30FC\u30F3
ActionDefinition.resume.name=\u518D\u958B
ActionDefinition.resume.description=\u518D\u958B
ActionDefinition.runToLine.name=\u6307\u5B9A\u884C\u307E\u3067\u5B9F\u884C
ActionDefinition.runToLine.description=\u518D\u958B\u3057\u3001\u73FE\u5728\u884C\u307E\u3067\u5B9F\u884C\u3059\u308B\u3068\u4E2D\u65AD\u3057\u307E\u3059\u3002
ActionDefinition.terminate.name=\u7D42\u4E86
ActionDefinition.terminate.description=\u7D42\u4E86
ActionDefinition.toggleBreakpoint.name=\u884C\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u306E\u5207\u308A\u66FF\u3048
ActionDefinition.toggleBreakpoint.description=\u884C\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3092\u4F5C\u6210\u307E\u305F\u306F\u9664\u53BB\u3057\u307E\u3059\u3002
ActionDefinition.suspend.name=\u4E2D\u65AD
ActionDefinition.suspend.description=\u4E2D\u65AD
ActionDefinition.openProfile.name=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB...
ActionDefinition.openProfile.description=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u8D77\u52D5\u69CB\u6210\u30C0\u30A4\u30A2\u30ED\u30B0\u3092\u958B\u304D\u307E\u3059\u3002
ActionDefinition.profileLast.name=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB
ActionDefinition.profileLast.description=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u30FB\u30E2\u30FC\u30C9\u3067\u524D\u56DE\u306E\u8D77\u52D5\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
ActionDefinition.openRun.name=\u8D77\u52D5\u69CB\u6210\u306E\u5B9F\u884C...
ActionDefinition.openRun.description=\u8D77\u52D5\u69CB\u6210\u306E\u5B9F\u884C\u30C0\u30A4\u30A2\u30ED\u30B0\u3092\u958B\u304D\u307E\u3059\u3002
ActionDefinition.debugLast.name=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u30C7\u30D0\u30C3\u30B0
ActionDefinition.debugLast.description=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u30C7\u30D0\u30C3\u30B0\u30FB\u30E2\u30FC\u30C9\u3067\u30C7\u30D0\u30C3\u30B0\u3057\u307E\u3059\u3002
ActionDefinition.runLast.name=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u5B9F\u884C
ActionDefinition.runLast.description=\u524D\u56DE\u306E\u8D77\u52D5\u3092\u5B9F\u884C\u30E2\u30FC\u30C9\u3067\u518D\u8D77\u52D5\u3057\u307E\u3059\u3002
ActionDefinition.openDebug.name=\u30C7\u30D0\u30C3\u30B0...
ActionDefinition.openDebug.description=\u30C7\u30D0\u30C3\u30B0\u8D77\u52D5\u69CB\u6210\u30C0\u30A4\u30A2\u30ED\u30B0\u3092\u958B\u304D\u307E\u3059\u3002
ActionDefinition.followHyperlink.name=\u30CF\u30A4\u30D1\u30FC\u30EA\u30F3\u30AF\u306B\u5F93\u3046
ActionDefinition.followHyperlink.description=\u30C7\u30D0\u30C3\u30B0\u30FB\u30B3\u30F3\u30BD\u30FC\u30EB\u3067\u30CF\u30A4\u30D1\u30FC\u30EA\u30F3\u30AF\u306B\u5F93\u3044\u307E\u3059\u3002
ActionDefinition.toggleWatchpoint.name=\u76E3\u8996\u30DD\u30A4\u30F3\u30C8\u306E\u5207\u308A\u66FF\u3048
ActionDefinition.toggleWatchpoint.description=\u76E3\u8996\u30DD\u30A4\u30F3\u30C8\u3092\u4F5C\u6210\u307E\u305F\u306F\u9664\u53BB\u3057\u307E\u3059\u3002
ActionDefinition.toggleMethodBreakpoint.name=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u306E\u5207\u308A\u66FF\u3048
ActionDefinition.toggleMethodBreakpoint.description=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3092\u4F5C\u6210\u307E\u305F\u306F\u9664\u53BB\u3057\u307E\u3059\u3002
ActionDefinition.skipAllBreakpoints.name=\u3059\u3079\u3066\u306E\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3092\u30B9\u30AD\u30C3\u30D7
ActionDefinition.skipAllBreakpoints.description=\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u3092\u4E2D\u65AD\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
ViewCommand.debugView.name=\u30C7\u30D0\u30C3\u30B0
ViewCommand.debugView.description=\u30C7\u30D0\u30C3\u30B0\u30FB\u30D3\u30E5\u30FC\u3092\u8868\u793A\u3057\u307E\u3059\u3002
ViewCommand.breakpointView.name=\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8
ViewCommand.breakpointView.description=\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u30FB\u30D3\u30E5\u30FC\u3092\u8868\u793A\u3057\u307E\u3059\u3002
ViewCommand.variableView.name=\u5909\u6570
ViewCommand.variableView.description=\u5909\u6570\u30D3\u30E5\u30FC\u3092\u8868\u793A\u3057\u307E\u3059\u3002
ViewCommand.expressionView.name=\u5F0F
ViewCommand.expressionView.description=\u5F0F\u30D3\u30E5\u30FC\u3092\u8868\u793A\u3057\u307E\u3059\u3002
ViewCommand.registerView.name=\u30EC\u30B8\u30B9\u30BF\u30FC
ViewCommand.registerView.description=\u30EC\u30B8\u30B9\u30BF\u30FC\u30FB\u30D3\u30E5\u30FC\u3092\u8868\u793A\u3057\u307E\u3059\u3002
ViewCommand.memoryView.name=\u30E1\u30E2\u30EA\u30FC
ViewCommand.memoryView.description=\u30E1\u30E2\u30EA\u30FC\u30FB\u30D3\u30E5\u30FC\u3092\u8868\u793A\u3057\u307E\u3059\u3002
SkipAllBreakpointsAction.label=\u3059\u3079\u3066\u306E\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8\u3092\u30B9\u30AD\u30C3\u30D7(&S)
editWatchExpressionAction.label=\u76E3\u8996\u5F0F\u3092\u7DE8\u96C6(&E)
editWatchExpressionAction.tooltip=\u9078\u629E\u3055\u308C\u305F\u76E3\u8996\u5F0F\u3092\u7DE8\u96C6
reevaluateWatchExpressionAction.label=\u76E3\u8996\u5F0F\u3092\u518D\u8A55\u4FA1(&R)
reevaluateWatchExpressionAction.tooltip=\u9078\u629E\u3055\u308C\u305F\u30B9\u30BF\u30C3\u30AF\u30FB\u30D5\u30EC\u30FC\u30E0\u5185\u306E\u76E3\u8996\u5F0F\u3092\u518D\u8A55\u4FA1
addWatchExpressionAction.label=\u76E3\u8996\u5F0F\u3092\u8FFD\u52A0(&A)
addWatchExpressionAction.tooltip=\u65B0\u898F\u76E3\u8996\u5F0F\u3092\u4F5C\u6210
convertToWatchExpressionAction.label=\u76E3\u8996\u5F0F\u306B\u5909\u63DB(&W)
convertToWatchExpressionAction.tooltip=\u30A4\u30F3\u30B9\u30DA\u30AF\u30B7\u30E7\u30F3\u5F0F\u3092\u76E3\u8996\u5F0F\u306B\u5909\u63DB
Watch.label=\u76E3\u8996(&T)
enableWatchExpressionAction.label=\u4F7F\u7528\u53EF\u80FD\u306B\u3059\u308B
enableWatchExpressionAction.tooltip=\u76E3\u8996\u5F0F\u3092\u4F7F\u7528\u53EF\u80FD\u306B\u3059\u308B
disableWatchExpressionAction.label=\u4F7F\u7528\u4E0D\u53EF\u306B\u3059\u308B
disableWatchExpressionAction.tooltip=\u76E3\u8996\u5F0F\u3092\u4F7F\u7528\u4E0D\u53EF\u306B\u3059\u308B
BreakpointMarkerPreference.label=\u30D6\u30EC\u30FC\u30AF\u30DD\u30A4\u30F3\u30C8
SourceContainerPresentationsName=\u30BD\u30FC\u30B9\u30FB\u30B3\u30F3\u30C6\u30CA\u30FC\u8868\u793A
DebugContextMenu.label=\u30C7\u30D0\u30C3\u30B0(&D)
RunContextMenu.label=\u5B9F\u884C(&R)
ProfileContextMenu.label=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB(&P)
LaunchMenuNoneApplicable.label=(\u9069\u7528\u306A\u3057)
containerName.workingSet=\u30EF\u30FC\u30AD\u30F3\u30B0\u30FB\u30BB\u30C3\u30C8
sourceNotFoundEditorName=\u30BD\u30FC\u30B9\u672A\u691C\u51FA\u30A8\u30C7\u30A3\u30BF\u30FC
debugPresentation.label=\u30C7\u30D0\u30C3\u30B0
MemoryViewName=\u30E1\u30E2\u30EA\u30FC
MemoryRenderingViewName=\u30E1\u30E2\u30EA\u30FC\u30FB\u30EC\u30F3\u30C0\u30EA\u30F3\u30B0
MemoryViewTableFontDefinition.label=\u30E1\u30E2\u30EA\u30FC\u30FB\u30D3\u30E5\u30FC\u30FB\u30C6\u30FC\u30D6\u30EB\u30FB\u30D5\u30A9\u30F3\u30C8
MemoryViewTableFontDefinition.description=\u30E1\u30E2\u30EA\u30FC\u30FB\u30D3\u30E5\u30FC\u30FB\u30C6\u30FC\u30D6\u30EB\u3067\u4F7F\u7528\u3055\u308C\u308B\u30D5\u30A9\u30F3\u30C8\u3002
RawHex=16 \u9032
rawHexMemoryRendering.name=Raw 16 \u9032\u30E1\u30E2\u30EA\u30FC\u30FB\u30EC\u30F3\u30C0\u30EA\u30F3\u30B0
ViewManagementAction.label=\u30D3\u30E5\u30FC\u7BA1\u7406(&V)...
