#Mon Aug 16 15:43:04 EDT 2004
PLUGIN_NAME=\u864E\u306E\u5DFB
PROVIDER_NAME=Eclipse.org
CHEAT_SHEET_CONTENT=\u864E\u306E\u5DFB\u306E\u5185\u5BB9
CHEAT_SHEET_ITEM_EXTENSION=\u864E\u306E\u5DFB\u9805\u76EE\u62E1\u5F35
CHEAT_SHEETS=\u864E\u306E\u5DFB
CHEAT_SHEETS_MENU=\u864E\u306E\u5DFB(&C)...
ERROR_READING_STATE_FILE=\u72B6\u614B\u60C5\u5831\u3092\u8AAD\u307F\u53D6\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
ERROR_WRITING_STATE_FILE=\u72B6\u614B\u60C5\u5831\u3092\u4FDD\u7BA1\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
CHEAT_SHEET_SELECTION_DIALOG_TITLE=\u864E\u306E\u5DFB\u306E\u9078\u629E
CHEAT_SHEET_SELECTION_DIALOG_MSG=\u30AA\u30FC\u30D7\u30F3\u3059\u308B\u864E\u306E\u5DFB\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\:
COLLAPSE_ALL_BUT_CURRENT_TOOLTIP=\u73FE\u5728\u306E\u9805\u76EE\u3092\u9664\u3044\u3066\u3059\u3079\u3066\u7E2E\u5C0F\u8868\u793A
RESTORE_ALL_TOOLTIP=\u76F4\u524D\u306E\u5C55\u958B\u72B6\u614B\u306B\u5C55\u958B
CHEAT_SHEET_OTHER_MENU=\u305D\u306E\u4ED6...
PERFORM_TASK_TOOLTIP=\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u5B9F\u884C
SKIP_TASK_TOOLTIP=\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u30B9\u30AD\u30C3\u30D7
COMPLETE_TASK_TOOLTIP=\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u5B8C\u4E86
RESTART_TASK_TOOLTIP=\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u3084\u308A\u76F4\u3057
LESS_THAN_2_SUBITEMS=\u6B21\u306E\u30A2\u30A4\u30C6\u30E0\u306B\u306F 2 \u9805\u76EE\u672A\u6E80\u306E\u30B5\u30D6\u30FB\u30A2\u30A4\u30C6\u30E0\u3057\u304B\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u308C\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002\u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_FINDING_PLUGIN_FOR_ACTION=\u30D7\u30E9\u30B0\u30A4\u30F3 ''{0}'' \u304C\u898B\u3064\u304B\u3089\u306A\u3044\u305F\u3081\u3001\u30A2\u30AF\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ERROR_DATA_MISSING=\u6B20\u843D\u30C7\u30FC\u30BF\u304C\u539F\u56E0\u3067\u3001\u864E\u306E\u5DFB\u306E\u5B9F\u884C\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_DATA_MISSING_LOG=\u5909\u6570 ''{0}'' \u306E\u30C7\u30FC\u30BF\u306E\u4F7F\u7528\u3092\u8A66\u307F\u305F\u3068\u3053\u308D\u3001\u30C7\u30FC\u30BF\u304C\u6B63\u3057\u304F\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ERROR_CONDITIONAL_DATA_MISSING_LOG=conditional-subitem ''{1}'' \u306B\u6307\u5B9A\u3055\u308C\u305F\u6761\u4EF6 ''{0}'' \u306B\u4E00\u81F4\u3059\u308B\u30B5\u30D6\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
ERROR_LOADING_CLASS_FOR_ACTION=''{0}'' \u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3067\u304D\u306A\u3044\u305F\u3081\u3001\u30A2\u30AF\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ERROR_CREATING_CLASS_FOR_ACTION=''{0}'' \u30AF\u30E9\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u4F5C\u6210\u3067\u304D\u306A\u3044\u305F\u3081\u3001\u30A2\u30AF\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
START_CHEATSHEET_TOOLTIP=\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u958B\u59CB\u3057\u307E\u3059
RESTART_CHEATSHEET_TOOLTIP=\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u518D\u958B\u3057\u307E\u3059
HELP_BUTTON_TOOLTIP=\u95A2\u9023\u30D8\u30EB\u30D7\u3092\u958B\u304F
ERROR_RUNNING_ACTION=\u30A2\u30AF\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_INVALID_CHEATSHEET_ID=\u864E\u306E\u5DFB ''{0}'' \u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_CHEATSHEET_DOESNOT_EXIST=\u6307\u5B9A\u3055\u308C\u305F\u864E\u306E\u5DFB\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_APPLYING_STATE_DATA=\u73FE\u884C\u306E\u864E\u306E\u5DFB\u306E\u4FDD\u7BA1\u72B6\u614B\u306F\u9069\u7528\u3055\u308C\u307E\u305B\u3093\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_APPLYING_STATE_DATA_LOG=\u73FE\u884C ''{1}'' \u864E\u306E\u5DFB\u306E ''{0}'' \u30D5\u30A1\u30A4\u30EB\u304B\u3089\u4FDD\u7BA1\u72B6\u614B\u3092\u9069\u7528\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002 
INITIAL_VIEW_DIRECTIONS=\u864E\u306E\u5DFB\u3092\u8868\u793A\u3059\u308B\u306B\u306F\u3001\u300C\u30D8\u30EB\u30D7\u300D\u30E1\u30CB\u30E5\u30FC\u307E\u305F\u306F\u30D3\u30E5\u30FC\u306E\u30ED\u30FC\u30AB\u30EB\u30FB\u30C4\u30FC\u30EB\u30D0\u30FC\u306E\u30E1\u30CB\u30E5\u30FC\u304B\u3089\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_LOADING_CHEATSHEET_CONTENT=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30ED\u30FC\u30C9\u30FB\u30A8\u30E9\u30FC\u3002
ERROR_PAGE_MESSAGE=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C9\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_LOADING_CLASS=''{0}'' \u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_CREATING_CLASS=''{0}'' \u30AF\u30E9\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002  \u864E\u306E\u5DFB\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u9023\u7D61\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CHEAT_SHEET_OTHER_CATEGORY=\u305D\u306E\u4ED6
LAUNCH_SHEET_ERROR=\u864E\u306E\u5DFB\u30D3\u30E5\u30FC\u306E\u30ED\u30FC\u30C9\u30FB\u30A8\u30E9\u30FC
CHEAT_SHEET_ERROR_OPENING=\u864E\u306E\u5DFB\u30AA\u30FC\u30D7\u30F3\u30FB\u30A8\u30E9\u30FC
ERROR_OPENING_PERSPECTIVE=\u30D1\u30FC\u30B9\u30DA\u30AF\u30C6\u30A3\u30D6\u306E\u30AA\u30FC\u30D7\u30F3\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
ERROR_CREATING_STATEFILE_URL=\u72B6\u614B\u30D5\u30A1\u30A4\u30EB URL ''{0}'' \u306E\u4F5C\u6210\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
ERROR_SAVING_STATEFILE_URL=''{0}'' \u864E\u306E\u5DFB\u306E\u72B6\u614B\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u7BA1\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
ERROR_READING_MANAGERDATA_FROM_STATEFILE=''{1}'' \u864E\u306E\u5DFB\u306E\u72B6\u614B\u30D5\u30A1\u30A4\u30EB\u304B\u3089\u30AD\u30FC ''{0}'' \u306E CheatSheetManager \u30C7\u30FC\u30BF\u3092\u8AAD\u307F\u53D6\u308A\u4E2D\u306B\u30A8\u30E9\u30FC\u3002
CHEAT_SHEET_INTRO_TITLE=\u6982\u8981 
ERROR_TITLE=\u864E\u306E\u5DFB\u306E\u30A8\u30E9\u30FC
ERROR_CREATING_DOCUMENT_BUILDER=DocumentBuilder \u306E\u4F5C\u6210\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3001JRE \u304C\u6B63\u3057\u304F\u30BB\u30C3\u30C8\u30A2\u30C3\u30D7\u3055\u308C\u3066\u3044\u308B\u3053\u3068\u3092\u691C\u67FB\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_DOCUMENT_BUILDER_NOT_INIT=DocumentBuilder \u304C\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3001JRE \u304C\u6B63\u3057\u304F\u30BB\u30C3\u30C8\u30A2\u30C3\u30D7\u3055\u308C\u3066\u3044\u308B\u3053\u3068\u3092\u691C\u67FB\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ERROR_OPENING_FILE=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB {0} \u3092\u958B\u3051\u307E\u305B\u3093\u3067\u3057\u305F
ERROR_OPENING_FILE_IN_PARSER=\u30D1\u30FC\u30B5\u30FC\u306F\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB ''{0}'' \u3092\u898B\u3064\u3051\u3089\u308C\u307E\u305B\u3093\u3067\u3057\u305F
ERROR_SAX_PARSING=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB ''{0}'' \u3092\u69CB\u6587\u89E3\u6790\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F
ERROR_SAX_PARSING_WITH_LOCATION=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB ''{0}'' \u3092\u69CB\u6587\u89E3\u6790\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3001\u884C ''{1}''\u3001\u5217 ''{2}''\u3002
ERROR_PARSING_CHEATSHEET_CONTENTS=\u864E\u306E\u5DFB DOM \u306E\u69CB\u6587\u89E3\u6790\u3067\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
ERROR_PARSING_CHEATSHEET_ELEMENT=<cheatsheet> \u30A8\u30EC\u30E1\u30F3\u30C8\u306F\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB\u306E\u30EB\u30FC\u30C8\u30FB\u30CE\u30FC\u30C9\u306B\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
ERROR_PARSING_NO_INTRO=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB\u306B\u306F <intro> \u30A8\u30EC\u30E1\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
ERROR_PARSING_MORE_THAN_ONE_INTRO=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB\u306B\u306F <intro> \u30A8\u30EC\u30E1\u30F3\u30C8\u3092 1 \u3064\u3057\u304B\u542B\u3081\u3089\u308C\u307E\u305B\u3093\u3002
ERROR_PARSING_NO_ITEM=\u864E\u306E\u5DFB\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30D5\u30A1\u30A4\u30EB\u306B\u306F\u5C11\u306A\u304F\u3068\u3082 1 \u3064\u306E <item> \u30A8\u30EC\u30E1\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
ERROR_PARSING_PARAM_INVALIDRANGE=\u30A2\u30AF\u30B7\u30E7\u30F3\u306B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC ''{0}'' \u304C\u3042\u308A\u307E\u3059\u304C\u3001\u3053\u308C\u306F\u7121\u52B9\u306A\u7BC4\u56F2 ''{1}'' \u3092\u6307\u5B9A\u3057\u3066\u3044\u307E\u3057\u305F\u3002
ERROR_PARSING_PARAM_INVALIDNUMBER=\u30A2\u30AF\u30B7\u30E7\u30F3\u306B\u306F\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u6570\u3092\u6307\u5B9A\u3059\u308B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_DESCRIPTION=\u30A8\u30EC\u30E1\u30F3\u30C8 ''{0}'' \u306E\u8A18\u8FF0\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
ERROR_PARSING_NO_SUBITEM=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F\u30B5\u30D6\u9805\u76EE\u30A8\u30EC\u30E1\u30F3\u30C8\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_ACTION=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F\u30A2\u30AF\u30B7\u30E7\u30F3\u30FB\u30A8\u30EC\u30E1\u30F3\u30C8\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_TITLE=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F Title \u5C5E\u6027\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_CLASS=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F\u30AF\u30E9\u30B9\u5C5E\u6027\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_PLUGINID=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F pluginId \u5C5E\u6027\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_CONDITION=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F Condition \u5C5E\u6027\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_VALUES=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F Value \u5C5E\u6027\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
ERROR_PARSING_NO_LABEL=''{0}'' \u30A8\u30EC\u30E1\u30F3\u30C8\u306F Label \u5C5E\u6027\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
WARNING_PARSING_UNKNOWN_ATTRIBUTE=\u4E0D\u660E\u306A\u5C5E\u6027 ''{0}'' \u304C\u30A8\u30EC\u30E1\u30F3\u30C8 ''{1}'' \u306B\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002
WARNING_PARSING_UNKNOWN_ELEMENT=\u4E0D\u660E\u306A\u30A8\u30EC\u30E1\u30F3\u30C8 ''{0}'' \u304C\u30A8\u30EC\u30E1\u30F3\u30C8 ''{1}'' \u306B\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002
WARNING_PARSING_DESCRIPTION_UNKNOWN_ELEMENT=\u30A8\u30EC\u30E1\u30F3\u30C8 ''{0}'' \u306E\u8A18\u8FF0\u306B\u4E0D\u660E\u306A\u30A8\u30EC\u30E1\u30F3\u30C8 ''{1}'' \u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
